---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarInSystem.ScheduleMark
source: html/678c6f55-4d6c-ac21-069a-1f8de09f7bd4.htm
---
# Autodesk.Revit.DB.Structure.RebarInSystem.ScheduleMark Property

The Schedule Mark parameter. On creation, the Schedule Mark is set
 to a value that is unique to the host, but it can be set to
 any value.

## Syntax (C#)
```csharp
public string ScheduleMark { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null